[
  {
    "start": 0,
    "end": 3,
    "text": "Concept of development ਅਤੇ learning ਦੇ ਆਪਸੀ ਸਬੰਧ ਨੂੰ ਸਮਝਣਾ Child Development & Pedagogy ਦਾ ਬਹੁਤ ਕੇਂਦਰੀ ਵਿਸ਼ਾ ਹੈ, ਖ਼ਾਸ ਕਰਕੇ PSTET-2026 ਦੀ ਤਿਆਰੀ ਲਈ। Development ਦਾ ਅਰਥ ਸਿਰਫ਼ ਲੰਬਾਈ ਜਾਂ ਭਾਰ ਵਿੱਚ ਵਾਧਾ ਨਹੀਂ ਹੁੰਦਾ, ਸਗੋਂ ਇਹ ਇੱਕ ਲਗਾਤਾਰ ਅਤੇ ਕ੍ਰਮਬੱਧ ਪ੍ਰਕਿਰਿਆ ਹੈ ਜਿਸ ਵਿੱਚ ਬੱਚੇ ਦੇ ਸਰੀਰਕ, ਸੰਜਾਣਾਤਮਕ (cognitive), ਭਾਵਾਤਮਕ (emotional) ਅਤੇ ਸਮਾਜਿਕ (social) ਪੱਖਾਂ ਵਿੱਚ ਗੁਣਾਤਮਕ ਬਦਲਾਅ ਹੁੰਦੇ ਹਨ। Development ਬੱਚੇ ਦੀ ਕੁੱਲ ਸਮਰੱਥਾ, ਸੋਚਣ ਦੇ ਢੰਗ, ਵਿਹਾਰ ਅਤੇ ਸਮਝ ਵਿੱਚ ਹੋਣ ਵਾਲੇ ਤਬਦੀਲੀਆਂ ਨੂੰ ਦਰਸਾਉਂਦੀ ਹੈ। Learning, ਦੂਜੇ ਪਾਸੇ, ਅਨੁਭਵ ਅਤੇ ਅਭਿਆਸ ਰਾਹੀਂ ਪ੍ਰਾਪਤ ਗਿਆਨ, ਹੁਨਰ ਅਤੇ ਵਿਹਾਰਕ ਬਦਲਾਅ ਨੂੰ ਕਹਿੰਦੀ ਹੈ। ਇਹ ਦੋਵੇਂ ਧਾਰਨਾਵਾਂ ਵੱਖਰੀਆਂ ਦਿਸਦੀਆਂ ਹਨ, ਪਰ ਅਸਲ ਵਿੱਚ ਇਹ ਇਕ-ਦੂਜੇ ਨਾਲ ਗਹਿਰਾਈ ਨਾਲ ਜੁੜੀਆਂ ਹਨ। Development ਅਤੇ learning ਦੇ ਸਬੰਧ ਨੂੰ ਸਮਝਣ ਲਈ ਸਭ ਤੋਂ ਪਹਿਲਾਂ ਇਹ ਜਾਣਨਾ ਜ਼ਰੂਰੀ ਹੈ ਕਿ development readiness ਪੈਦਾ ਕਰਦੀ ਹੈ। Readiness ਦਾ ਅਰਥ ਹੈ ਕਿ ਬੱਚਾ ਕਿਸੇ ਨਵੀਂ ਚੀਜ਼ ਨੂੰ ਸਿੱਖਣ ਲਈ ਮਨੋਵਿਗਿਆਨਕ ਅਤੇ ਸੰਜਾਣਾਤਮਕ ਤੌਰ ‘ਤੇ ਤਿਆਰ ਹੈ ਜਾਂ ਨਹੀਂ। ਉਦਾਹਰਨ ਵਜੋਂ, ਜੇਕਰ ਇੱਕ ਬੱਚੇ ਵਿੱਚ ਤਰਕਸ਼ੀਲ ਸੋਚ (logical thinking) ਦੀ ਯੋਗਤਾ ਅਜੇ ਪੂਰੀ ਤਰ੍ਹਾਂ ਵਿਕਸਿਤ ਨਹੀਂ ਹੋਈ, ਤਾਂ ਉਸਨੂੰ ਜਟਿਲ abstract concepts ਸਿਖਾਉਣਾ ਪ੍ਰਭਾਵਸ਼ਾਲੀ ਨਹੀਂ ਹੋਵੇਗਾ। ਇਸਦਾ ਮਤਲਬ ਇਹ ਹੈ ਕਿ learning ਦੀ ਪ੍ਰਭਾਵਸ਼ੀਲਤਾ development ‘ਤੇ ਨਿਰਭਰ ਕਰਦੀ ਹੈ। Development ਬਿਨਾਂ learning ਅਸਥਿਰ ਜਾਂ ਉਪਰਿ-ਉਪਰਿ ਰਹਿ ਸਕਦੀ ਹੈ। ਇਸੇ ਤਰ੍ਹਾਂ, learning ਵੀ development ਨੂੰ ਪ੍ਰਭਾਵਿਤ ਕਰਦੀ ਹੈ। ਜਦੋਂ ਬੱਚਾ ਨਵੇਂ ਅਨੁਭਵ ਕਰਦਾ ਹੈ, ਸਮੱਸਿਆਵਾਂ ਹੱਲ ਕਰਦਾ ਹੈ, ਅਤੇ ਵਾਤਾਵਰਣ ਨਾਲ ਸੰਚਾਰ ਕਰਦਾ ਹੈ, ਤਾਂ ਉਸਦੀ ਸੋਚ, ਸਮਝ ਅਤੇ ਵਿਹਾਰ ਵਿੱਚ ਨਵੇਂ ਗੁਣਾਤਮਕ ਬਦਲਾਅ ਆਉਂਦੇ ਹਨ। ਇਸ ਪ੍ਰਕਿਰਿਆ ਰਾਹੀਂ development ਹੋਰ ਨਿਖਰਦੀ ਹੈ। ਇਸ ਲਈ development ਅਤੇ learning ਨੂੰ ਇੱਕ ਦੋ-ਤਰਫ਼ਾ (bidirectional) ਸਬੰਧ ਵਜੋਂ ਦੇਖਣਾ ਚਾਹੀਦਾ ਹੈ। Development learning ਲਈ ਆਧਾਰ ਬਣਾਉਂਦੀ ਹੈ, ਅਤੇ learning development ਨੂੰ ਤੇਜ਼ ਅਤੇ ਮਜ਼ਬੂਤ ਕਰਦੀ ਹੈ। 11–14 ਸਾਲ ਦੇ ਉਮਰ-ਵਰਗ ਦੇ ਸੰਦਰਭ ਵਿੱਚ, ਜੋ PSTET Paper-2 ਲਈ ਮਹੱਤਵਪੂਰਨ ਹੈ, ਬੱਚਿਆਂ ਵਿੱਚ cognitive development ਦਾ ਵਿਸ਼ੇਸ਼ ਵਾਧਾ ਹੁੰਦਾ ਹੈ। ਇਸ ਉਮਰ ਵਿੱਚ learners abstract ਸੋਚਣ, ਤਰਕ ਕਰਨ ਅਤੇ hypothetical situations ਨੂੰ ਸਮਝਣ ਦੀ ਯੋਗਤਾ ਵਿਕਸਿਤ ਕਰਦੇ ਹਨ। ਅਧਿਆਪਕ ਲਈ ਇਹ ਸਮਝਣਾ ਜ਼ਰੂਰੀ ਹੈ ਕਿ ਇਸ stage ‘ਤੇ teaching strategies ਵੀ ਬਦਲਣੀਆਂ ਚਾਹੀਦੀਆਂ ਹਨ। ਜੇ ਅਧਿਆਪਕ development stage ਦੇ ਅਨੁਕੂਲ ਪਾਠ ਯੋਜਨਾ ਤਿਆਰ ਕਰਦਾ ਹੈ, ਤਾਂ learning ਹੋਰ ਅਰਥਪੂਰਨ ਬਣਦੀ ਹੈ। ਇਹ child-centered pedagogy ਦੀ ਬੁਨਿਆਦ ਹੈ। Development ਦੇ ਕੁਝ ਮੁੱਖ ਸਿਧਾਂਤ ਵੀ learning ਨਾਲ ਜੁੜੇ ਹਨ। Development ਲਗਾਤਾਰ ਹੁੰਦੀ ਹੈ, ਪਰ ਹਰ ਬੱਚੇ ਦੀ ਗਤੀ ਵੱਖਰੀ ਹੋ ਸਕਦੀ ਹੈ। ਇਸਦਾ ਅਰਥ ਹੈ ਕਿ ਇੱਕ ਹੀ ਕਲਾਸ ਵਿੱਚ learners ਦੀ readiness ਅਤੇ ਸਮਰੱਥਾ ਵਿੱਚ ਅੰਤਰ ਹੋ ਸਕਦਾ ਹੈ। Effective facilitator ਉਹ ਹੁੰਦਾ ਹੈ ਜੋ individual differences ਨੂੰ ਸਮਝ ਕੇ teaching ਨੂੰ ਅਨੁਕੂਲ ਕਰੇ। Rigid teaching methods development ਦੇ ਸਿਧਾਂਤਾਂ ਦੇ ਵਿਰੁੱਧ ਹੁੰਦੇ ਹਨ, ਜਦਕਿ flexible ਅਤੇ learner-friendly methods learning ਨੂੰ ਵਧਾਉਂਦੇ ਹਨ। Pedagogical ਦ੍ਰਿਸ਼ਟੀਕੋਣ ਤੋਂ, development ਅਤੇ learning ਦੇ ਸਬੰਧ ਦਾ ਅਰਥ ਹੈ ਕਿ teaching ਸਿਰਫ਼ ਜਾਣਕਾਰੀ ਦੇਣ ਦੀ ਪ੍ਰਕਿਰਿਆ ਨਹੀਂ, ਸਗੋਂ learners ਦੀ developmental needs ਨੂੰ ਧਿਆਨ ਵਿੱਚ ਰੱਖਣੀ ਚਾਹੀਦੀ ਹੈ। Assessment ਵੀ ਇਸੇ ਅਨੁਸਾਰ ਹੋਣਾ ਚਾਹੀਦਾ ਹੈ। ਜੇ assessment ਕੇਵਲ ਯਾਦਸ਼ਕਤੀ (memory) ‘ਤੇ ਆਧਾਰਿਤ ਹੋਵੇ, ਤਾਂ ਇਹ development ਦੀ ਪੂਰੀ ਤਸਵੀਰ ਨਹੀਂ ਦਿੰਦਾ। Conceptual understanding ਅਤੇ application-based evaluation learners ਦੀ ਅਸਲ growth ਨੂੰ ਮਾਪਦੇ ਹਨ। ਅੰਤ ਵਿੱਚ, PSTET-style ਪ੍ਰਸ਼ਨ ਅਕਸਰ ਇਸ ਗੱਲ ਦੀ ਜਾਂਚ ਕਰਦੇ ਹਨ ਕਿ ਉਮੀਦਵਾਰ development ਅਤੇ learning ਦੇ ਸਬੰਧ ਨੂੰ ਕਲਾਸਰੂਮ ਸਥਿਤੀਆਂ ਵਿੱਚ ਕਿਵੇਂ ਸਮਝਦਾ ਹੈ। ਇਸ ਲਈ ਤਿਆਰੀ ਦੌਰਾਨ definitions ਨਾਲ ਨਾਲ examples ਅਤੇ classroom implications ‘ਤੇ ਧਿਆਨ ਦੇਣਾ ਬਹੁਤ ਜ਼ਰੂਰੀ ਹੈ। Development ਅਤੇ learning ਇਕ-ਦੂਜੇ ਦੇ ਵਿਰੋਧੀ ਨਹੀਂ, ਸਗੋਂ ਪੂਰਕ ਹਨ। ਇਹੀ ਸਮਝ ਇੱਕ ਅਧਿਆਪਕ ਨੂੰ ਪ੍ਰਭਾਵਸ਼ਾਲੀ facilitator ਬਣਾਉਂਦੀ ਹੈ ਅਤੇ learners ਲਈ learning ਨੂੰ ਅਰਥਪੂਰਨ ਅਤੇ ਦਿਰਘਕਾਲੀ ਬਣਾਉਂਦੀ ਹੈ।"
  }
]